# base1024千字文
b_千字文中有10个字重复已替换 = (
    "并饼、诚城、发筏、洁杰、昆鲲、盘磻、戚汽、实势、义役、云芸"
)
b_新加24个字组成1024 = "脑洞竞技 代码逆向 漏洞挖掘 团队协作 密码破译 云端对决"
b_千字文 = """
天地玄黄 宇宙洪荒 日月盈昃 辰宿列张 寒来暑往 秋收冬藏 闰余成岁 律吕调阳 云腾致雨 露结为霜 金生丽水 玉出昆冈 
剑号巨阙 珠称夜光 果珍李柰 菜重芥姜 海咸河淡 鳞潜羽翔 龙师火帝 鸟官人皇 始制文字 乃服衣裳 推位让国 有虞陶唐 
吊民伐罪 周发殷汤 坐朝问道 垂拱平章 爱育黎首 臣伏戎羌 遐迩一体 率宾归王 鸣凤在竹 白驹食场 化被草木 赖及万方 
盖此身筏 四大五常 恭惟鞠养 岂敢毁伤 女慕贞洁 男效才良 知过必改 得能莫忘 罔谈彼短 靡恃己长 信使可覆 器欲难量 
墨悲丝染 诗赞羔羊 景行维贤 克念作圣 德建名立 形端表正 空谷传声 虚堂习听 祸因恶积 福缘善庆 尺璧非宝 寸阴是竞 
资父事君 曰严与敬 孝当竭力 忠则尽命 临深履薄 夙兴温凊 似兰斯馨 如松之盛 川流不息 渊澄取映 容止若思 言辞安定 
笃初诚美 慎终宜令 荣业所基 籍甚无竟 学优登仕 摄职从政 存以甘棠 去而益咏 乐殊贵贱 礼别尊卑 上和下睦 夫唱妇随 
外受傅训 入奉母仪 诸姑伯叔 犹子比儿 孔怀兄弟 同气连枝 交友投分 切磨箴规 仁慈隐恻 造次弗离 节义廉退 颠沛匪亏 
性静情逸 心动神疲 守真志满 逐物意移 坚持雅操 好爵自縻 都邑华夏 东西二京 背邙面洛 浮渭据泾 宫殿盘郁 楼观飞惊 
图写禽兽 画彩仙灵 丙舍旁启 甲帐对楹 肆筵设席 鼓瑟吹笙 升阶纳陛 弁转疑星 右通广内 左达承明 既集坟典 亦聚群英 
杜稿钟隶 漆书壁经 府罗将相 路侠槐卿 户封八县 家给千兵 高冠陪辇 驱毂振缨 世禄侈富 车驾肥轻 策功茂实 勒碑刻铭 
磻溪伊尹 佐时阿衡 奄宅曲阜 微旦孰营 桓公匡合 济弱扶倾 绮回汉惠 说感武丁 俊役密勿 多士势宁 晋楚更霸 赵魏困横 
假途灭虢 践土会盟 何遵约法 韩弊烦刑 起翦颇牧 用军最精 宣威沙漠 驰誉丹青 九州禹迹 百郡秦并 岳宗泰岱 禅主芸亭 
雁门紫塞 鸡田赤城 鲲池碣石 钜野洞庭 旷远绵邈 岩岫杳冥 治本于农 务兹稼穑 俶载南亩 我艺黍稷 税熟贡新 劝赏黜陟 
孟轲敦素 史鱼秉直 庶几中庸 劳谦谨敕 聆音察理 鉴貌辨色 贻厥嘉猷 勉其祗植 省躬讥诫 宠增抗极 殆辱近耻 林皋幸即 
两疏见机 解组谁逼 索居闲处 沉默寂寥 求古寻论 散虑逍遥 欣奏累遣 汽谢欢招 渠荷的历 园莽抽条 枇杷晚翠 梧桐蚤凋 
陈根委翳 落叶飘摇 游鹍独运 凌摩绛霄 耽读玩市 寓目囊箱 易輶攸畏 属耳垣墙 具膳餐饭 适口充肠 饱饫烹宰 饥厌糟糠 
亲戚故旧 老少异粮 妾御绩纺 侍巾帷房 纨扇圆杰 银烛炜煌 昼眠夕寐 蓝笋象床 弦歌酒宴 接杯举觞 矫手顿足 悦豫且康 
嫡后嗣续 祭祀烝尝 稽颡再拜 悚惧恐惶 笺牒简要 顾答审详 骸垢想浴 执热愿凉 驴骡犊特 骇跃超骧 诛斩贼盗 捕获叛亡 
布射僚丸 嵇琴阮啸 恬笔伦纸 钧巧任钓 释纷利俗 饼皆佳妙 毛施淑姿 工颦妍笑 年矢每催 曦晖朗曜 璇玑悬斡 晦魄环照 
指薪修祜 永绥吉劭 矩步引领 俯仰廊庙 束带矜庄 徘徊瞻眺 孤陋寡闻 愚蒙等诮 谓语助者 焉哉乎也 
网络纪元 全球疫变 程序编码 先苦尾甜 统创六界 倒至坤乾"""

b_千字文 = b_千字文.replace("\n", "").replace(" ", "")  # 先去掉空格和换行


def h_千进制编码(s0=None, s1=None, s2=None, s3=None, s4=None):
    """
    s0、s1、s2 依次为第一、二、三个字节
    1 10 11 100 101 110 111 1000
    1  2  3   4   5   6   7    8
    """
    # print(s0, s1, s2, s3, s4)  # 32
    a1 = s0 << 2
    # print(a1)  # 128
    a2 = (s1 & 192) >> 6
    # print(a2)  # 0
    a = a1 + a2
    # print(a)
    a = b_千字文[a]
    # print(a)
    b1 = (s1 & 63) << 4
    # print(b1)
    b2 = (s2 & 240) >> 4
    # print(b2)
    b = b1 + b2
    # print(b)
    b = b_千字文[b]
    # print(b)
    c1 = (s2 & 15) << 6
    # print(c1)
    c2 = (s3 & 252) >> 2
    # print(c2)
    c = c1 + c2
    # print(c)
    c = b_千字文[c]
    # print(c)
    d1 = (s3 & 3) << 8
    # print(d1)
    d2 = s4
    # print(d2)
    d = d1 + d2
    # print(d)
    d = b_千字文[d]
    # print(d)
    # print(''.join([a, b, c, d]))
    return "".join([a, b, c, d])


def h_千字文编码(b_字节数据):
    b_字节个数 = len(b_字节数据)
    if b_字节个数 == 0:
        print("千字文编码字节为0")
        return ""
    # 不是5的倍数补齐
    b_字节余数 = b_字节个数 % 5
    if b_字节余数 == 1:
        b_字节数据 += b"\x00\x00\x00\x00"
        b_字节个数 += 4
    elif b_字节余数 == 2:
        b_字节数据 += b"\x00\x00\x00"
        b_字节个数 += 3
    elif b_字节余数 == 3:
        b_字节数据 += b"\x00\x00"
        b_字节个数 += 2
    elif b_字节余数 == 4:
        b_字节数据 += b"\x00"
        b_字节个数 += 1
    # print(b_字节个数,'个字节')
    # 开始调用处理
    i = 0
    base_千字文 = ""
    while i < b_字节个数 - 5:
        b_返回四字 = h_千进制编码(
            b_字节数据[i],
            b_字节数据[i + 1],
            b_字节数据[i + 2],
            b_字节数据[i + 3],
            b_字节数据[i + 4],
        )
        base_千字文 += b_返回四字
        i += 5
        # print(str(i)+'个已完成')
    b_返回四字 = h_千进制编码(
        b_字节数据[i],
        b_字节数据[i + 1],
        b_字节数据[i + 2],
        b_字节数据[i + 3],
        b_字节数据[i + 4],
    )
    base_千字文 += b_返回四字[0]

    if b_字节余数 == 4 or b_字节余数 == 0:
        base_千字文 += b_返回四字[1]
        base_千字文 += b_返回四字[2]
        base_千字文 += b_返回四字[3]
        if b_字节余数 == 4:
            base_千字文 += "零"
    elif b_字节余数 == 3:
        base_千字文 += b_返回四字[1]
        base_千字文 += b_返回四字[2]
        base_千字文 += "零零"
    elif b_字节余数 == 2:
        base_千字文 += b_返回四字[1]
        base_千字文 += "零零零"
    elif b_字节余数 == 1:
        base_千字文 += "零零零零"
    # print(base_千字文)
    return base_千字文

    # h_二进制位移(20, 0x86, 0xaf)


def h_千进制解码(a=None, b=None, c=None, d=None):

    # a1=922;        b1=137;      c1=121;     d1=648
    # 11100110|10 001000|1001 0001|111001 10|10001000
    # 230    136
    # 参考数字转字节 - 远洪 - 博客园 https://www.cnblogs.com/liyuanhong/p/12133745.html

    a1 = b_千字文.find(a)
    b1 = b_千字文.find(b)
    c1 = b_千字文.find(c)
    d1 = b_千字文.find(d)
    # print(a1, b1, c1, d1)  # 千字文不存在的字返回-1
    if a1 == -1 or b1 == -1 or c1 == -1 or d1 == -1:
        raise Exception("出错:有字符不在千字文内")
    s0 = (a1 & 1020) >> 2  # 前8个
    s0 = s0.to_bytes(1, byteorder="big")  # 转为字节码
    # print(s0)  # 32
    s1_1 = (a1 & 3) << 6  # 后2个
    s1_2 = (b1 & 1008) >> 4  # 前6个
    s1 = s1_1 + s1_2
    s1 = s1.to_bytes(1, byteorder="big")  # 转为字节码
    # print(s1)
    s2_1 = (b1 & 15) << 4  # 后4个
    s2_2 = (c1 & 960) >> 6  # 前4个
    s2 = s2_1 + s2_2
    s2 = s2.to_bytes(1, byteorder="big")  # 转为字节码
    # print(s2)
    s3_1 = (c1 & 63) << 2  # 后6个
    s3_2 = (d1 & 768) >> 8  # 前2个
    s3 = s3_1 + s3_2
    s3 = s3.to_bytes(1, byteorder="big")  # 转为字节码
    # print(s3)
    s4 = d1 & 255  # 后8个
    s4 = s4.to_bytes(1, byteorder="big")  # 转为字节码
    # print(s4)

    # print(s0+s1+s2+s3+s4)
    return s0 + s1 + s2 + s3 + s4


def h_千字文解码(b_千字文码):
    b_字个数 = len(b_千字文码)
    if b_字个数 == 0:
        print("千字文解码字数为0")
        return b""
    b_零的数量 = 0
    while b_千字文码[-1] == "零":
        b_千字文码 = b_千字文码[0:-1]
        b_零的数量 += 1
        # print(b_千字文码)
        # print(b_零的数量)
    b_千字文个数 = len(b_千字文码)
    # 不是4的倍数补个天
    b_千字文余数 = b_千字文个数 % 4
    if b_千字文余数 == 1:
        b_千字文码 += "天天天"
        b_千字文个数 += 3
    elif b_千字文余数 == 2:
        b_千字文码 += "天天"
        b_千字文个数 += 2
    elif b_千字文余数 == 3:
        b_千字文码 += "天"
        b_千字文个数 += 1

        # 开始调用处理
    i = 0
    b_字节码 = b""
    # print(b_千字文码)
    while i < b_千字文个数 - 4:
        b_返回五字节 = h_千进制解码(
            b_千字文码[i], b_千字文码[i + 1], b_千字文码[i + 2], b_千字文码[i + 3]
        )
        b_字节码 += b_返回五字节
        i += 4
        # print(str(i)+'个已完成')
    b_返回五字节 = h_千进制解码(
        b_千字文码[i], b_千字文码[i + 1], b_千字文码[i + 2], b_千字文码[i + 3]
    )
    b_字节码 += b_返回五字节
    # print(b_字节码)
    if b_零的数量 > 0:
        b_字节码 = b_字节码[0:-b_零的数量]
    # print(b_字节码)
    return b_字节码


if __name__ == "__main__":
    b_已解字节内容 = h_千字文解码(
        "利师迩鉴石碣遥逍汉玄珍覆穑碣云罗侈平同此竹岱饭乎见槐洛五伦璧策缘芸武秦伤阮空创欲雁刻分超任策迩释机于焉笃僚施迩姿植沙疫书曲亲零零零"
    )  # b_千字文编码)
    b_文本内容 = b_已解字节内容.decode("utf-8")
    print("解码好的:" + b_文本内容)
    print(f"flag{{{b_文本内容}}}")

    # 脑洞竞技 代码逆向 漏洞挖掘 团队协作 密码破译 云端对决
