import base64


def manbo_decode(manbo_text: str):
    t = manbo_text.replace("曼波", "0")
    t = t.replace("哦耶", "1")
    t = t.replace("哇嗷", "2")
    return t


def base3_to_str(base3_s: str):
    s = [base3_s[i : i + 5] for i in range(0, len(base3_s), 5)]
    cipher = ""
    for i in range(len(s)):
        cipher += chr(int(s[i], 3))

    return cipher


def RC4_decrypt(cipher, K):
    S = [0] * 256
    T = [0] * 256
    for i in range(0, 256):
        S[i] = i
        T[i] = K[i % len(K)]

    j = 0
    for i in range(0, 256):
        j = (j + S[i] + ord(T[i])) % 256
        S[i], S[j] = S[j], S[i]

    i = 0
    j = 0

    plain = []
    cipher = base64.b64decode(cipher.encode()).decode()
    for s in cipher:
        i = (i + 1) % 256
        j = (j + S[i]) % 256
        S[i], S[j] = S[j], S[i]
        t = (S[i] + S[j]) % 256
        k = S[t]
        plain.append(chr(ord(s) ^ k))

    return "".join(plain)


def decode(key, manbo_text):
    base3_s = manbo_decode(manbo_text)
    cipher = base3_to_str(base3_s)
    plain_text = RC4_decrypt(cipher, key)
    return plain_text


manboList = [
    (
        "800",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哦耶哇嗷哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "449",
        "曼波哇嗷哦耶哦耶曼波哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "365",
        "哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波曼波曼波曼波哇嗷哇嗷哦耶哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "556",
        "哦耶曼波曼波哦耶哦耶哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "460",
        "哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波曼波曼波哦耶曼波曼波哇嗷哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "154",
        "哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波曼波曼波哦耶哦耶曼波哦耶曼波曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "596",
        "曼波哇嗷哇嗷哇嗷曼波哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "112",
        "哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波曼波哦耶曼波哦耶哇嗷哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "827",
        "哦耶哦耶哦耶曼波哇嗷曼波哦耶哇嗷哇嗷哦耶哦耶曼波哇嗷哇嗷哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "817",
        "哦耶曼波哦耶哇嗷哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "132",
        "哦耶哦耶哦耶曼波哇嗷曼波哦耶哇嗷哇嗷哇嗷曼波哦耶哇嗷哦耶曼波曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "501",
        "哦耶哦耶哦耶曼波哇嗷曼波哦耶哇嗷哇嗷哦耶哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "961",
        "哦耶哦耶哦耶曼波哇嗷曼波哦耶哇嗷哇嗷哇嗷哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "970",
        "哦耶曼波哇嗷曼波曼波哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "749",
        "哦耶曼波曼波曼波哦耶哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "577",
        "曼波哇嗷哦耶曼波哇嗷哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "241",
        "哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波曼波曼波哦耶哦耶曼波哦耶曼波曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "881",  # w
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哦耶哦耶曼波哇嗷哦耶哇嗷曼波曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "565",
        "哦耶哦耶哦耶曼波哇嗷曼波哦耶哇嗷哇嗷哇嗷哦耶哦耶曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "818",
        "哦耶曼波曼波曼波哦耶哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "805",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波曼波哇嗷哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "918",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哦耶哦耶哦耶哦耶曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "587",
        "曼波哇嗷哇嗷哇嗷哦耶哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "828",
        "曼波哇嗷哇嗷曼波哇嗷哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "297",
        "曼波哇嗷哦耶哇嗷曼波哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "414",
        "哦耶哦耶哦耶曼波哇嗷曼波哦耶哇嗷哇嗷哇嗷哦耶曼波哇嗷曼波曼波曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "313",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波曼波哦耶哇嗷哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "364",
        "曼波哇嗷哇嗷曼波哇嗷哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "948",
        "哦耶曼波哦耶哇嗷哇嗷哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "982",
        "哦耶曼波曼波哇嗷哦耶曼波哇嗷哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "381",
        "哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波曼波曼波曼波哦耶哇嗷哦耶曼波曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "749",
        "哦耶曼波曼波曼波哦耶哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "102",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哦耶曼波曼波哦耶哇嗷哦耶曼波曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "416",  # _
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哦耶哇嗷曼波哇嗷曼波曼波哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "602",
        "哦耶曼波曼波曼波哇嗷哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "113",
        "曼波哇嗷哇嗷哇嗷曼波哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "638",
        "哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "903",
        "哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "652",  # _
        "曼波哇嗷哇嗷哦耶哇嗷哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "88",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哦耶哇嗷曼波哦耶哇嗷哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "355",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哦耶曼波哦耶曼波哇嗷哇嗷哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "303",
        "曼波哇嗷哦耶哇嗷曼波哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "725",
        "曼波哇嗷哇嗷哦耶哇嗷哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "423",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哦耶哇嗷曼波哇嗷哦耶哇嗷曼波曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "651",
        "哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波曼波曼波曼波哇嗷哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "476",
        "哦耶曼波曼波哦耶哇嗷哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "195",
        "曼波哇嗷哇嗷哇嗷哦耶哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "175",  # M
        "哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波曼波哦耶曼波哦耶哇嗷哦耶曼波曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "134",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "292",
        "哦耶曼波哦耶哇嗷哇嗷哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "24",  # _
        "曼波哇嗷哇嗷哇嗷曼波曼波哇嗷哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "512",
        "哦耶哦耶哦耶曼波哇嗷曼波哦耶哇嗷哇嗷哇嗷曼波哇嗷哇嗷哦耶哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "343",
        "哦耶曼波曼波哦耶曼波哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "581",
        "曼波哇嗷哇嗷哇嗷曼波哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "4",
        "曼波哇嗷哦耶哇嗷曼波哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "247",
        "哦耶曼波哇嗷哦耶曼波哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "84",
        "哦耶曼波哦耶哇嗷哇嗷哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "445",
        "哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波曼波曼波曼波哦耶哇嗷哦耶曼波曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "664",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哦耶哦耶哦耶曼波曼波哇嗷哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "434",
        "曼波哇嗷哦耶曼波哇嗷哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "249",
        "哦耶哦耶哦耶曼波哇嗷曼波哦耶哇嗷哇嗷哦耶曼波哦耶哇嗷哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "21",
        "哦耶曼波曼波哦耶哦耶哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "287",
        "哦耶曼波曼波哇嗷曼波哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "741",
        "哦耶曼波曼波哦耶哇嗷哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "188",
        "曼波哇嗷哇嗷哇嗷哇嗷哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "316",
        "曼波哇嗷哦耶哦耶哇嗷哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "513",
        "哦耶曼波曼波曼波曼波哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "565",
        "哦耶哦耶哦耶曼波哇嗷曼波哦耶哇嗷哇嗷哦耶曼波哇嗷哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "73",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波曼波哇嗷哇嗷哦耶哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "378",
        "曼波哇嗷哇嗷曼波曼波哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "472",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哦耶哇嗷哦耶哦耶曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "831",
        "哦耶哦耶哦耶曼波哇嗷曼波哦耶哇嗷哇嗷哇嗷哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "391",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哦耶曼波哦耶曼波哇嗷哇嗷哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "847",
        "哦耶曼波哇嗷哦耶曼波哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "68",
        "哦耶曼波曼波哦耶哇嗷哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "706",
        "哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波曼波曼波哦耶哦耶曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "280",
        "哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波曼波曼波曼波哇嗷曼波曼波哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "163",
        "曼波哇嗷哦耶哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "196",
        "哦耶曼波曼波哦耶曼波哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "687",
        "哦耶曼波曼波曼波哇嗷哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "171",
        "哦耶曼波哇嗷曼波哦耶哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "591",
        "哦耶曼波曼波曼波曼波哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "276",
        "哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波曼波曼波哦耶曼波曼波哇嗷哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "391",
        "哦耶哦耶哦耶曼波哇嗷哦耶哦耶曼波哦耶哇嗷曼波哇嗷哇嗷哦耶哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "42",
        "哦耶曼波哇嗷曼波曼波哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "335",
        "哦耶曼波曼波哇嗷哇嗷哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "818",
        "哦耶曼波曼波哇嗷哇嗷哦耶曼波哇嗷哦耶哦耶曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "5",
        "哦耶哦耶哦耶曼波哇嗷曼波哦耶哇嗷哇嗷哇嗷哦耶曼波哇嗷哇嗷哇嗷曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "451",
        "曼波哇嗷哇嗷哦耶曼波曼波哇嗷哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "199",
        "哦耶曼波曼波哦耶哦耶哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "611",
        "曼波哇嗷哇嗷哇嗷哦耶哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "312",
        "曼波哇嗷哇嗷哦耶哦耶哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "302",
        "曼波哇嗷哇嗷哇嗷曼波哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "596",
        "曼波哇嗷哦耶哦耶哇嗷哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "798",
        "哦耶曼波哇嗷哦耶曼波曼波哇嗷哦耶曼波哇嗷曼波哇嗷曼波哇嗷哦耶曼波哇嗷曼波哇嗷哦耶",
    ),
    (
        "663",
        "哦耶哦耶哦耶曼波哇嗷曼波哇嗷曼波曼波曼波哦耶曼波曼波曼波曼波曼波哇嗷曼波哇嗷哦耶",
    ),
]
for key, manbo_text in manboList:
    plain_text = decode(key, manbo_text)
    print(plain_text, end="")
